Белгипрозем_2017/src/Catalogs/СертификатыЭП/СертификатыЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СертификатыЭП</name>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоСертификату</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапомнитьПарольКСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеКратко</name>
    <comment>Человекопонятное назначение сертификата, вводимое пользователем</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьДоступКСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещенОСрокеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Пользователь, кому доступен сертификат подписи</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьСоставИсполнителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <comment>Двоичные данные сертификата</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНастроекКриптографии</name>
    <type>
      <types>CatalogRef.ПрофилиНастроекКриптографии</types>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Усиленный</name>
    <comment>Сертификат является усиленным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДокументов</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляПодписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставИсполнителей</name>
    <comment>Список пользователей, после утверждения или подписания которых, документ переходит на подпись по данному сертификату</comment>
    <attributes>
      <name>Исполнитель</name>
      <comment>Пользователь или группа пользователей</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/СертификатыЭП/Forms/ВыборСертификатаДляРасшифрованияЕдинственныйСертификат/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("СертификатДляРасшифрования")
		ИЛИ ТипЗнч(Параметры.СертификатДляРасшифрования) <> Тип("СправочникСсылка.СертификатыЭП") Тогда
		
		ВызватьИсключение НСтр("ru = 'Не найден сертификат для подписания.'");
	КонецЕсли;
	
	// Чтение данных сертификата.
	СертификатДляРасшифрования = Параметры.СертификатДляРасшифрования;
	СертификатДляРасшифрованияОтпечаток = СертификатДляРасшифрования.Отпечаток;
	СертификатДляРасшифрованияУсиленный = СертификатДляРасшифрования.Усиленный;
	СертификатДляРасшифрованияНастройкиКриптографии =
		РаботаСЭП.ПрофильНастроекКриптографииПоСертификату(СертификатДляРасшифрования.Отпечаток);
	Если ЗначениеЗаполнено(СертификатДляРасшифрования.НазначениеКратко) Тогда
		НазначениеСертификата = СертификатДляРасшифрования.НазначениеКратко;
	Иначе
		НазначениеСертификата = СтрЗаменить(СокрЛП(СертификатДляРасшифрования.Назначение),
			Символы.ПС, ", ");
	КонецЕсли;
	СертификатДляРасшифрованияПредставлениеHTML = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"<html>
		|<body>
		|<style>
		|* { font-family: sans-serif; font-size: 8pt; }
		|body { padding: 0; margin: 8px; overflow: auto; }
		|table { border-collapse: collapse; }
		|table td { padding: 0 4px 0 0; border: 0; vertical-align: top; }
		|table td.col1 { vertical-align: top; color: #606060; width: 80px; }
		|</style>
		|<table>
		|<tr><td class=""col1"">%1:</td><td>%2</td></tr>
		|<tr><td class=""col1"">%3:</td><td>%4</td></tr>
		|<tr><td class=""col1"">%5:</td><td>%6</td></tr>
		|<tr><td class=""col1"">%7:</td><td>%8</td></tr>
		|</table>
		|</body>
		|</html>",
		НСтр("ru = 'Кому выдан'"),
		СертификатДляРасшифрования.КомуВыдан,
		НСтр("ru = 'Кем выдан'"),
		СертификатДляРасшифрования.КемВыдан,
		НСтр("ru = 'Действует до'"),
		Формат(СертификатДляРасшифрования.ДатаОкончания, "ДФ=dd.MM.yyyy"),
		НСтр("ru = 'Назначение'"),
		НазначениеСертификата);
	
	// Установка начальной видимости элементов.
	Элементы.Пароль.Видимость = Не СертификатДляРасшифрованияУсиленный;
	Элементы.ГруппаИнформацияДляУсиленных.Видимость = СертификатДляРасшифрованияУсиленный;
	
	ФайлСсылка = Неопределено;
	Если Параметры.Свойство("ФайлСсылка") Тогда
		ФайлСсылка = Параметры.ФайлСсылка;
	КонецЕсли;
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Расшифровать ""%1""'"),
		Строка(ФайлСсылка));
	
	ПоказыватьИнструкции = ПолучитьФункциональнуюОпцию("ИспользоватьИнструкции");
	ПолучитьИнструкции();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки["ПоказыватьИнструкции"] <> Неопределено
		И ПолучитьФункциональнуюОпцию("ИспользоватьИнструкции") Тогда
		
		ПолучитьИнструкции();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработкаВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификат(Команда)
	
	ПоказатьЗначение(Неопределено, СертификатДляРасшифрования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаВыбора()
	
	// Возвращаемое значение:
	//  Структура -
	//   Пароль - Строка - Пароль к закрытому ключу.
	//   НастройкиКриптографии - Структура или Неопределено, если нет связки с настройками криптографии 
	//    ПровайдерЭП - Строка
	//    ПутьМодуляКриптографии - Строка
	//    ТипПровайдераЭП - Число
	//    АлгоритмПодписи - Строка
	//    АлгоритмХеширования - Строка
	//    АлгоритмШифрования - Строка
	
	ВозвратПароль = Пароль;
	Если ПустаяСтрока(Пароль) И НЕ ПустаяСтрока(Элементы.Пароль.ТекстРедактирования) Тогда
		ВозвратПароль = Элементы.Пароль.ТекстРедактирования;
	КонецЕсли;
	
	ВыбранныйСертификат = ЭлектроннаяПодписьКлиент.ПолучитьСертификатПоОтпечатку(СертификатДляРасшифрованияОтпечаток);
	НастройкиКриптографии = Новый Структура(
		"ПровайдерЭП,
		|ПутьМодуляКриптографии,
		|ТипПровайдераЭП,
		|АлгоритмПодписи,
		|АлгоритмХеширования,
		|АлгоритмШифрования");
	ЗаполнитьЗначенияСвойств(НастройкиКриптографии, СертификатДляРасшифрованияНастройкиКриптографии);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НастройкиКриптографии", НастройкиКриптографии);
	
	Если СертификатДляРасшифрованияУсиленный Тогда
		СтруктураВозврата.Вставить("Пароль", "");
	Иначе
		СтруктураВозврата.Вставить("Пароль", ВозвратПароль);
	КонецЕсли;
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#Область РаботаСИнструкциями

&НаСервере
Процедура ПолучитьИнструкции()
	
	РаботаСИнструкциями.ПолучитьИнструкции(ЭтаФорма, 50, 80);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструкцияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСИнструкциямиКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element, Элемент.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИнструкции(Команда)
	
	ПоказыватьИнструкции = Не ПоказыватьИнструкции;
	ПолучитьИнструкции();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
